Model: "sequential_1" 
_________________________________________________________________
Layer (type)                 Output Shape              Param #    
=================================================================
dense_1 (Dense)              (None, None, 3)           12291      
_________________________________________________________________
dense_2 (Dense)              (None, None, 3)           12         
=================================================================
Total params: 12,303
Trainable params: 12,303
Non-trainable params: 0
_________________________________________________________________
 
